Tekla Open API Reference for Tekla Structures 2025
Polymesh.ConvertInvalidInfoFromStruct Method
 Convert a struct of invalid info to a list of pairs of outer loop index and error code. Read indexes and error codes from the integer list.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static List<KeyValuePair<int, Polymesh.PolymeshHealthCheckEnum>> ConvertInvalidInfoFromStruct(
	ref dotPolymeshValidateInvalidInfo_t input
)
Public Shared Function ConvertInvalidInfoFromStruct (
	ByRef input As dotPolymeshValidateInvalidInfo_t
) As List(Of KeyValuePair(Of Integer, Polymesh.PolymeshHealthCheckEnum))
Parameters
input
Type: dotPolymeshValidateInvalidInfo_t
Invalid info passed from TS core
Return Value
Type: List<KeyValuePair<Int32, Polymesh.PolymeshHealthCheckEnum>>
A list of pairs of outer loop index, error code
See Also
Reference
Polymesh Class
Tekla.Structures.Model Namespace